system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    location        "system";
    object          controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     reactingFoam;

startFrom       latestTime;

stopAt          endTime;

endTime         0.25;

deltaT          1e-06;

adjustTimeStep  yes;

maxCo           0.4;

maxDeltaT       1e-06;

writeControl    adjustableRunTime;

writeInterval   0.001;

writePrecision  12;

purgeWrite      0;

writeFormat     binary;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable false;


functions
{
    
}




// ************************************************************************* //
