system/decomposeParDict
FoamFile {
    version 2.0;
    format ascii;
    class dictionary;
    object decomposeParDict;
}
method scotch;
numberOfSubdomains 2;
