system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue T 300
    volScalarFieldValue N2 0.77
    volScalarFieldValue O2 0.23
    volScalarFieldValue CH4 0
);

regions
(
    

    cylinderToCell
	{
		p1	(0 -0.1 1.85);
		p2	(0 -0.1 1.915);
		radius	0.02;
    fieldValues
    (
        volScalarFieldValue CH4 0.1561
        volScalarFieldValue O2 0.1966
        volScalarFieldValue N2 0.6473
    );
	}

	cylinderToCell
	{
		p1	(-0.1 0 1.84);
		p2	(-0.1 0 1.905);
		radius	0.02;
    fieldValues
    (
        volScalarFieldValue CH4 0.1561
        volScalarFieldValue O2 0.1966
        volScalarFieldValue N2 0.6473
    );

	}

	cylinderToCell
	{
		p1	(0.1 0 1.84);
		p2	(0.1 0 1.905);
		radius	0.02;
    fieldValues
    (
        volScalarFieldValue CH4 0.1561
        volScalarFieldValue O2 0.1966
        volScalarFieldValue N2 0.6473
    );
	}

	cylinderToCell
	{
		p1	(0 0.1 1.845);
		p2	(0 0.1 1.9100001);
		radius	0.02;
    fieldValues
    (
        volScalarFieldValue CH4 0.1561
        volScalarFieldValue O2 0.1966
        volScalarFieldValue N2 0.6473
    );
	}
);


// ************************************************************************* //
